###################################################################

# Created by write_sdc on Tue Nov 14 23:05:57 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
create_clock [get_ports clk]  -period 1.2  -waveform {0 0.6}
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  0  [get_ports i_cmd_valid]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[28]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[27]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[26]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[25]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[24]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[23]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[22]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[21]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[20]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[19]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[18]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[17]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[16]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[15]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[14]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[13]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[12]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[11]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[10]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[9]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[8]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[7]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[6]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[5]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[4]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[3]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[2]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[1]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[0]}]
set_input_delay -clock clk  0  [get_ports i_start]
set_input_delay -clock clk  0  [get_ports {i_start_info[7]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[6]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[5]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[4]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[3]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[2]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[1]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[0]}]
set_input_delay -clock clk  0  [get_ports i_finish_ack]
set_input_delay -clock clk  0  [get_ports i_init]
set_input_delay -clock clk  0  [get_ports i_reset]
set_input_delay -clock clk  0  [get_ports i_stop]
set_input_delay -clock clk  0  [get_ports i_rerun]
set_input_delay -clock clk  0  [get_ports ahb_cfg_hsel]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_htrans[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_htrans[0]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[31]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[30]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[29]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[28]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[27]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[26]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[25]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[24]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[23]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[22]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[21]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[20]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[19]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[18]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[17]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[16]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[15]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[14]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[13]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[12]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[11]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[10]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[9]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[8]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[7]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[6]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[5]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[4]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[3]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[2]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[0]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hburst[2]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hburst[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hburst[0]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hsize[2]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hsize[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hsize[0]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[31]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[30]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[29]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[28]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[27]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[26]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[25]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[24]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[23]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[22]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[21]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[20]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[19]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[18]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[17]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[16]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[15]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[14]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[13]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[12]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[11]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[10]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[9]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[8]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[7]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[6]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[5]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[4]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[3]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[2]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[0]}]
set_input_delay -clock clk  0  [get_ports ahb_cfg_hwrite]
set_input_delay -clock clk  0  [get_ports ahb_cfg_hreadyin]
set_input_delay -clock clk  0  [get_ports hclk]
set_input_delay -clock clk  0  [get_ports hreset]
set_input_delay -clock clk  0  [get_ports i_mem_ack]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[127]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[126]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[125]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[124]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[123]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[122]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[121]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[120]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[119]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[118]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[117]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[116]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[115]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[114]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[113]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[112]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[111]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[110]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[109]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[108]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[107]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[106]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[105]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[104]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[103]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[102]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[101]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[100]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[99]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[98]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[97]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[96]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[95]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[94]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[93]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[92]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[91]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[90]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[89]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[88]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[87]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[86]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[85]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[84]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[83]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[82]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[81]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[80]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[79]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[78]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[77]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[76]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[75]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[74]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[73]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[72]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[71]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[70]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[69]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[68]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[67]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[66]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[65]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[64]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[63]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[62]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[61]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[60]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[59]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[58]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[57]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[56]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[55]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[54]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[53]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[52]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[51]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[50]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[49]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[48]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[47]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[46]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[45]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[44]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[43]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[42]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[41]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[40]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[39]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[38]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[37]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[36]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[35]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[34]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[33]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[32]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[31]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[30]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[29]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[28]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[27]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[26]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[25]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[24]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[23]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[22]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[21]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[20]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[19]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[18]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[17]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[16]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[15]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[14]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[13]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[12]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[11]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[10]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[9]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[8]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[7]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[6]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[5]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[4]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[3]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[2]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[1]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_A[0]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[127]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[126]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[125]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[124]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[123]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[122]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[121]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[120]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[119]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[118]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[117]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[116]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[115]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[114]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[113]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[112]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[111]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[110]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[109]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[108]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[107]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[106]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[105]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[104]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[103]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[102]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[101]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[100]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[99]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[98]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[97]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[96]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[95]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[94]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[93]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[92]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[91]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[90]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[89]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[88]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[87]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[86]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[85]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[84]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[83]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[82]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[81]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[80]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[79]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[78]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[77]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[76]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[75]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[74]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[73]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[72]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[71]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[70]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[69]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[68]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[67]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[66]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[65]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[64]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[63]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[62]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[61]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[60]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[59]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[58]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[57]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[56]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[55]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[54]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[53]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[52]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[51]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[50]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[49]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[48]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[47]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[46]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[45]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[44]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[43]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[42]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[41]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[40]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[39]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[38]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[37]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[36]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[35]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[34]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[33]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[32]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[31]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[30]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[29]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[28]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[27]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[26]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[25]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[24]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[23]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[22]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[21]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[20]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[19]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[18]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[17]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[16]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[15]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[14]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[13]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[12]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[11]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[10]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[9]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[8]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[7]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[6]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[5]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[4]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[3]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[2]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[1]}]
set_input_delay -clock clk  0  [get_ports {i_m0_rd_data_B[0]}]
set_output_delay -clock clk  0  [get_ports o_cmd_ack]
set_output_delay -clock clk  0  [get_ports o_start_ack]
set_output_delay -clock clk  0  [get_ports o_finish]
set_output_delay -clock clk  0  [get_ports {o_finish_info[7]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[6]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[5]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[4]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[3]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[2]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[1]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[0]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[31]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[30]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[29]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[28]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[27]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[26]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[25]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[24]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[23]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[22]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[21]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[20]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[19]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[18]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[17]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[16]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[15]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[14]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[13]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[12]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[11]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[10]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[9]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[8]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[7]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[6]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[5]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[4]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[3]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[2]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[1]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[0]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hresp[1]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hresp[0]}]
set_output_delay -clock clk  0  [get_ports ahb_cfg_hready]
set_output_delay -clock clk  0  [get_ports o_mem_req]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[13]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[12]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[11]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[10]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[9]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[8]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[7]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[6]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[5]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[4]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[3]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[2]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[1]}]
set_output_delay -clock clk  0  [get_ports {o_mem_bm[0]}]
set_output_delay -clock clk  0  [get_ports o_m0_rd_en_A]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[17]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[16]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[15]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[14]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[13]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[12]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[11]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[10]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[9]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[8]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[7]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[6]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[5]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[4]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[3]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[2]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[1]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_A[0]}]
set_output_delay -clock clk  0  [get_ports o_m0_rd_en_B]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[17]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[16]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[15]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[14]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[13]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[12]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[11]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[10]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[9]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[8]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[7]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[6]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[5]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[4]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[3]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[2]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[1]}]
set_output_delay -clock clk  0  [get_ports {o_m0_rd_addr_B[0]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[15]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[14]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[13]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[12]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[11]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[10]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[9]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[8]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[7]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[6]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[5]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[4]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[3]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[2]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[1]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_A[0]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[127]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[126]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[125]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[124]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[123]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[122]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[121]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[120]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[119]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[118]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[117]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[116]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[115]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[114]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[113]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[112]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[111]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[110]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[109]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[108]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[107]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[106]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[105]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[104]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[103]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[102]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[101]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[100]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[99]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[98]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[97]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[96]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[95]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[94]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[93]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[92]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[91]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[90]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[89]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[88]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[87]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[86]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[85]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[84]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[83]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[82]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[81]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[80]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[79]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[78]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[77]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[76]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[75]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[74]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[73]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[72]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[71]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[70]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[69]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[68]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[67]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[66]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[65]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[64]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[63]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[62]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[61]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[60]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[59]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[58]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[57]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[56]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[55]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[54]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[53]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[52]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[51]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[50]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[49]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[48]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[47]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[46]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[45]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[44]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[43]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[42]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[41]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[40]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[39]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[38]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[37]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[36]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[35]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[34]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[33]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[32]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[31]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[30]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[29]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[28]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[27]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[26]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[25]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[24]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[23]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[22]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[21]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[20]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[19]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[18]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[17]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[16]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[15]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[14]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[13]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[12]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[11]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[10]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[9]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[8]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[7]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[6]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[5]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[4]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[3]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[2]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[1]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_A[0]}]
set_output_delay -clock clk  0  [get_ports o_m1_wr_en_A]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[17]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[16]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[15]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[14]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[13]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[12]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[11]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[10]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[9]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[8]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[7]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[6]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[5]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[4]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[3]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[2]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[1]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_A[0]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[15]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[14]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[13]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[12]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[11]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[10]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[9]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[8]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[7]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[6]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[5]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[4]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[3]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[2]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[1]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wea_B[0]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[127]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[126]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[125]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[124]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[123]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[122]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[121]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[120]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[119]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[118]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[117]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[116]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[115]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[114]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[113]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[112]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[111]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[110]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[109]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[108]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[107]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[106]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[105]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[104]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[103]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[102]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[101]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[100]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[99]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[98]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[97]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[96]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[95]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[94]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[93]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[92]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[91]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[90]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[89]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[88]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[87]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[86]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[85]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[84]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[83]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[82]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[81]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[80]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[79]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[78]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[77]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[76]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[75]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[74]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[73]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[72]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[71]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[70]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[69]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[68]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[67]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[66]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[65]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[64]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[63]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[62]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[61]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[60]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[59]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[58]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[57]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[56]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[55]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[54]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[53]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[52]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[51]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[50]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[49]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[48]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[47]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[46]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[45]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[44]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[43]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[42]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[41]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[40]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[39]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[38]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[37]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[36]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[35]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[34]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[33]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[32]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[31]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[30]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[29]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[28]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[27]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[26]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[25]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[24]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[23]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[22]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[21]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[20]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[19]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[18]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[17]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[16]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[15]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[14]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[13]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[12]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[11]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[10]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[9]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[8]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[7]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[6]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[5]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[4]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[3]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[2]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[1]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_data_B[0]}]
set_output_delay -clock clk  0  [get_ports o_m1_wr_en_B]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[17]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[16]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[15]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[14]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[13]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[12]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[11]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[10]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[9]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[8]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[7]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[6]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[5]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[4]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[3]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[2]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[1]}]
set_output_delay -clock clk  0  [get_ports {o_m1_wr_addr_B[0]}]
set_output_delay -clock clk  0  [get_ports {o_event[15]}]
set_output_delay -clock clk  0  [get_ports {o_event[14]}]
set_output_delay -clock clk  0  [get_ports {o_event[13]}]
set_output_delay -clock clk  0  [get_ports {o_event[12]}]
set_output_delay -clock clk  0  [get_ports {o_event[11]}]
set_output_delay -clock clk  0  [get_ports {o_event[10]}]
set_output_delay -clock clk  0  [get_ports {o_event[9]}]
set_output_delay -clock clk  0  [get_ports {o_event[8]}]
set_output_delay -clock clk  0  [get_ports {o_event[7]}]
set_output_delay -clock clk  0  [get_ports {o_event[6]}]
set_output_delay -clock clk  0  [get_ports {o_event[5]}]
set_output_delay -clock clk  0  [get_ports {o_event[4]}]
set_output_delay -clock clk  0  [get_ports {o_event[3]}]
set_output_delay -clock clk  0  [get_ports {o_event[2]}]
set_output_delay -clock clk  0  [get_ports {o_event[1]}]
set_output_delay -clock clk  0  [get_ports {o_event[0]}]
set_output_delay -clock clk  0  [get_ports {o_irq[3]}]
set_output_delay -clock clk  0  [get_ports {o_irq[2]}]
set_output_delay -clock clk  0  [get_ports {o_irq[1]}]
set_output_delay -clock clk  0  [get_ports {o_irq[0]}]
