###################################################################

# Created by write_sdc on Fri Nov 17 11:17:35 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  0  [get_ports clk1]
set_input_delay -clock clk  0  [get_ports i_switch]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[12]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[11]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[10]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[9]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[8]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[7]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[6]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[5]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[4]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[3]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[2]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[1]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SMP_CNT[0]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[9]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[8]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[7]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[6]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[5]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[4]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[3]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[2]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[1]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_CHP_CNT[0]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_FRM_CNT[3]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_FRM_CNT[2]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_FRM_CNT[1]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_FRM_CNT[0]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[16]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[15]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[14]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[13]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[12]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[11]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[10]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[9]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[8]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[7]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[6]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[5]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[4]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[3]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[2]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[1]}]
set_input_delay -clock clk  0  [get_ports {DC_EST_SCALE[0]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[12]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[11]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[10]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[9]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[8]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[7]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[6]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[5]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[4]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[3]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[2]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[1]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SMP_CNT[0]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[9]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[8]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[7]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[6]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[5]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[4]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[3]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[2]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[1]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_CHP_CNT[0]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_FRM_CNT[3]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_FRM_CNT[2]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_FRM_CNT[1]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_FRM_CNT[0]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[16]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[15]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[14]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[13]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[12]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[11]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[10]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[9]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[8]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[7]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[6]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[5]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[4]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[3]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[2]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[1]}]
set_input_delay -clock clk  0  [get_ports {INTF_EST_SCALE[0]}]
set_input_delay -clock clk  0  [get_ports {DC_config_mode[3]}]
set_input_delay -clock clk  0  [get_ports {DC_config_mode[2]}]
set_input_delay -clock clk  0  [get_ports {DC_config_mode[1]}]
set_input_delay -clock clk  0  [get_ports {DC_config_mode[0]}]
set_input_delay -clock clk  0  [get_ports {INTF_config_mode[3]}]
set_input_delay -clock clk  0  [get_ports {INTF_config_mode[2]}]
set_input_delay -clock clk  0  [get_ports {INTF_config_mode[1]}]
set_input_delay -clock clk  0  [get_ports {INTF_config_mode[0]}]
set_input_delay -clock clk  0  [get_ports {combination_config_mode[3]}]
set_input_delay -clock clk  0  [get_ports {combination_config_mode[2]}]
set_input_delay -clock clk  0  [get_ports {combination_config_mode[1]}]
set_input_delay -clock clk  0  [get_ports {combination_config_mode[0]}]
set_input_delay -clock clk  0  [get_ports {phase_config_mode[3]}]
set_input_delay -clock clk  0  [get_ports {phase_config_mode[2]}]
set_input_delay -clock clk  0  [get_ports {phase_config_mode[1]}]
set_input_delay -clock clk  0  [get_ports {phase_config_mode[0]}]
set_input_delay -clock clk  0  [get_ports phase_rom_sel]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[31]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[30]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[29]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[28]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[27]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[26]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[25]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[24]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[23]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[22]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[21]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[20]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[19]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[18]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[17]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[16]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[15]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[14]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[13]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[12]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[11]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[10]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[9]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[8]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[7]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[6]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[5]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[4]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[3]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[2]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[1]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addra[0]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[31]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[30]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[29]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[28]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[27]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[26]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[25]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[24]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[23]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[22]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[21]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[20]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[19]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[18]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[17]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[16]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[15]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[14]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[13]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[12]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[11]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[10]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[9]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[8]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[7]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[6]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[5]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[4]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[3]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[2]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[1]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_addrb[0]}]
set_input_delay -clock clk  0  [get_ports phase_rom_bwea]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[31]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[30]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[29]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[28]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[27]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[26]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[25]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[24]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[23]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[22]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[21]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[20]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[19]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[18]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[17]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[16]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[15]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[14]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[13]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[12]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[11]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[10]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[9]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[8]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[7]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[6]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[5]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[4]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[3]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[2]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[1]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_dina[0]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[31]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[30]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[29]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[28]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[27]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[26]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[25]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[24]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[23]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[22]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[21]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[20]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[19]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[18]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[17]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[16]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[15]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[14]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[13]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[12]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[11]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[10]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[9]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[8]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[7]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[6]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[5]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[4]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[3]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[2]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[1]}]
set_input_delay -clock clk  0  [get_ports {phase_rom_doutb[0]}]
set_input_delay -clock clk  0  [get_ports phase_rom_enb]
set_input_delay -clock clk  0  [get_ports phase_rom_wena]
set_input_delay -clock clk  0  [get_ports {phase_w[31]}]
set_input_delay -clock clk  0  [get_ports {phase_w[30]}]
set_input_delay -clock clk  0  [get_ports {phase_w[29]}]
set_input_delay -clock clk  0  [get_ports {phase_w[28]}]
set_input_delay -clock clk  0  [get_ports {phase_w[27]}]
set_input_delay -clock clk  0  [get_ports {phase_w[26]}]
set_input_delay -clock clk  0  [get_ports {phase_w[25]}]
set_input_delay -clock clk  0  [get_ports {phase_w[24]}]
set_input_delay -clock clk  0  [get_ports {phase_w[23]}]
set_input_delay -clock clk  0  [get_ports {phase_w[22]}]
set_input_delay -clock clk  0  [get_ports {phase_w[21]}]
set_input_delay -clock clk  0  [get_ports {phase_w[20]}]
set_input_delay -clock clk  0  [get_ports {phase_w[19]}]
set_input_delay -clock clk  0  [get_ports {phase_w[18]}]
set_input_delay -clock clk  0  [get_ports {phase_w[17]}]
set_input_delay -clock clk  0  [get_ports {phase_w[16]}]
set_input_delay -clock clk  0  [get_ports {phase_w[15]}]
set_input_delay -clock clk  0  [get_ports {phase_w[14]}]
set_input_delay -clock clk  0  [get_ports {phase_w[13]}]
set_input_delay -clock clk  0  [get_ports {phase_w[12]}]
set_input_delay -clock clk  0  [get_ports {phase_w[11]}]
set_input_delay -clock clk  0  [get_ports {phase_w[10]}]
set_input_delay -clock clk  0  [get_ports {phase_w[9]}]
set_input_delay -clock clk  0  [get_ports {phase_w[8]}]
set_input_delay -clock clk  0  [get_ports {phase_w[7]}]
set_input_delay -clock clk  0  [get_ports {phase_w[6]}]
set_input_delay -clock clk  0  [get_ports {phase_w[5]}]
set_input_delay -clock clk  0  [get_ports {phase_w[4]}]
set_input_delay -clock clk  0  [get_ports {phase_w[3]}]
set_input_delay -clock clk  0  [get_ports {phase_w[2]}]
set_input_delay -clock clk  0  [get_ports {phase_w[1]}]
set_input_delay -clock clk  0  [get_ports {phase_w[0]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[31]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[30]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[29]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[28]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[27]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[26]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[25]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[24]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[23]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[22]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[21]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[20]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[19]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[18]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[17]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[16]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[15]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[14]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[13]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[12]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[11]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[10]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[9]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[8]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[7]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[6]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[5]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[4]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[3]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[2]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[1]}]
set_input_delay -clock clk  0  [get_ports {phase_coe[0]}]
set_input_delay -clock clk  0  [get_ports i_start]
set_input_delay -clock clk  0  [get_ports m_axi_rd_arready]
set_input_delay -clock clk  0  [get_ports m_axi_rd_rvalid]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rid[3]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rid[2]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rid[1]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rid[0]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[127]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[126]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[125]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[124]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[123]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[122]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[121]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[120]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[119]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[118]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[117]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[116]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[115]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[114]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[113]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[112]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[111]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[110]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[109]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[108]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[107]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[106]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[105]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[104]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[103]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[102]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[101]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[100]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[99]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[98]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[97]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[96]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[95]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[94]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[93]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[92]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[91]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[90]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[89]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[88]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[87]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[86]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[85]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[84]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[83]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[82]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[81]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[80]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[79]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[78]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[77]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[76]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[75]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[74]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[73]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[72]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[71]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[70]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[69]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[68]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[67]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[66]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[65]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[64]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[63]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[62]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[61]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[60]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[59]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[58]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[57]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[56]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[55]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[54]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[53]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[52]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[51]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[50]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[49]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[48]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[47]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[46]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[45]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[44]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[43]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[42]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[41]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[40]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[39]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[38]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[37]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[36]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[35]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[34]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[33]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[32]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[31]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[30]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[29]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[28]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[27]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[26]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[25]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[24]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[23]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[22]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[21]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[20]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[19]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[18]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[17]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[16]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[15]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[14]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[13]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[12]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[11]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[10]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[9]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[8]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[7]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[6]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[5]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[4]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[3]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[2]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[1]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rdata[0]}]
set_input_delay -clock clk  0  [get_ports m_axi_rd_rlast]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rresp[1]}]
set_input_delay -clock clk  0  [get_ports {m_axi_rd_rresp[0]}]
set_input_delay -clock clk  0  [get_ports m_axi_wr_awready]
set_input_delay -clock clk  0  [get_ports m_axi_wr_wready]
set_input_delay -clock clk  0  [get_ports m_axi_wr_bvalid]
set_input_delay -clock clk  0  [get_ports {m_axi_wr_bid[3]}]
set_input_delay -clock clk  0  [get_ports {m_axi_wr_bid[2]}]
set_input_delay -clock clk  0  [get_ports {m_axi_wr_bid[1]}]
set_input_delay -clock clk  0  [get_ports {m_axi_wr_bid[0]}]
set_input_delay -clock clk  0  [get_ports {m_axi_wr_bresp[1]}]
set_input_delay -clock clk  0  [get_ports {m_axi_wr_bresp[0]}]
set_output_delay -clock clk  0  [get_ports o_end]
set_output_delay -clock clk  0  [get_ports m_axi_rd_arvalid]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arid[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arid[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arid[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arid[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[31]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[30]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[29]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[28]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[27]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[26]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[25]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[24]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[23]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[22]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[21]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[20]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[19]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[18]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[17]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[16]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[15]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[14]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[13]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[12]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[11]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[10]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[9]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[8]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[7]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[6]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[5]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[4]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_araddr[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arlen[7]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arlen[6]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arlen[5]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arlen[4]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arlen[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arlen[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arlen[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arlen[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arburst[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arburst[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arsize[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arsize[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arsize[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arcache[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arcache[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arcache[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arcache[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arprot[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arprot[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_rd_arprot[0]}]
set_output_delay -clock clk  0  [get_ports m_axi_rd_arlock]
set_output_delay -clock clk  0  [get_ports m_axi_rd_rready]
set_output_delay -clock clk  0  [get_ports m_axi_wr_awvalid]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awid[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awid[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awid[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awid[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[31]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[30]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[29]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[28]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[27]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[26]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[25]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[24]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[23]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[22]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[21]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[20]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[19]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[18]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[17]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[16]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[15]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[14]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[13]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[12]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[11]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[10]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[9]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[8]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[7]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[6]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[5]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[4]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awaddr[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awlen[7]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awlen[6]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awlen[5]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awlen[4]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awlen[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awlen[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awlen[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awlen[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awburst[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awburst[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awsize[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awsize[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awsize[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awcache[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awcache[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awcache[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awcache[0]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awprot[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awprot[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_awprot[0]}]
set_output_delay -clock clk  0  [get_ports m_axi_wr_awlock]
set_output_delay -clock clk  0  [get_ports m_axi_wr_wvalid]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[127]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[126]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[125]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[124]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[123]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[122]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[121]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[120]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[119]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[118]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[117]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[116]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[115]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[114]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[113]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[112]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[111]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[110]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[109]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[108]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[107]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[106]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[105]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[104]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[103]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[102]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[101]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[100]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[99]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[98]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[97]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[96]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[95]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[94]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[93]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[92]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[91]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[90]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[89]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[88]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[87]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[86]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[85]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[84]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[83]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[82]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[81]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[80]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[79]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[78]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[77]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[76]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[75]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[74]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[73]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[72]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[71]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[70]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[69]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[68]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[67]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[66]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[65]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[64]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[63]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[62]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[61]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[60]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[59]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[58]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[57]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[56]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[55]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[54]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[53]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[52]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[51]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[50]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[49]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[48]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[47]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[46]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[45]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[44]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[43]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[42]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[41]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[40]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[39]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[38]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[37]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[36]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[35]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[34]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[33]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[32]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[31]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[30]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[29]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[28]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[27]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[26]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[25]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[24]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[23]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[22]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[21]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[20]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[19]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[18]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[17]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[16]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[15]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[14]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[13]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[12]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[11]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[10]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[9]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[8]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[7]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[6]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[5]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[4]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wdata[0]}]
set_output_delay -clock clk  0  [get_ports m_axi_wr_wlast]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[15]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[14]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[13]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[12]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[11]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[10]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[9]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[8]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[7]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[6]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[5]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[4]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[3]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[2]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[1]}]
set_output_delay -clock clk  0  [get_ports {m_axi_wr_wstrb[0]}]
set_output_delay -clock clk  0  [get_ports m_axi_wr_bready]
