Job <54498> is submitted to default queue <interactive>.

                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

               Version R-2020.09-SP4 for linux64 - Mar 02, 2021 

                    Copyright (c) 1988 - 2021 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...
#/**************************************************/
#/* Compile Script for Synopsys                    */
#/*                                                */
#/* dc_shell-t -f compile_dc.tcl                   */
#/*                                                */
#/* SMIC 40nm                                      */
#/**************************************************/
#/* All verilog files, separated by spaces         */
set root_dir "/home/users/yuyushan/sim/rsp_s2_cp/syn/src"
/home/users/yuyushan/sim/rsp_s2_cp/syn/src
set my_verilog_files [list $root_dir/axi4/axi_v4_rd_if.sv $root_dir/axi4/axi_v4_wr_if.sv $root_dir/axi4_master_write.sv $root_dir/axi4_master_read.sv $root_dir/chirp_processing_core.sv $root_dir/chirp_processing_top.sv $root_dir/diff.sv $root_dir/abs_cmp.sv $root_dir/abs_complex.sv $root_dir/abs_real.sv $root_dir/buffer_8data.sv $root_dir/chirp_processing_multiplier0.sv $root_dir/combination.sv $root_dir/delay_data.sv $root_dir/estimation.sv $root_dir/fifo_cp.v $root_dir/tb/delay.v $root_dir/mult_cp.v   
]
/home/users/yuyushan/sim/rsp_s2_cp/syn/src/axi4/axi_v4_rd_if.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/axi4/axi_v4_wr_if.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/axi4_master_write.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/axi4_master_read.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/chirp_processing_core.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/chirp_processing_top.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/diff.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/abs_cmp.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/abs_complex.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/abs_real.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/buffer_8data.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/chirp_processing_multiplier0.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/combination.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/delay_data.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/estimation.sv /home/users/yuyushan/sim/rsp_s2_cp/syn/src/fifo_cp.v /home/users/yuyushan/sim/rsp_s2_cp/syn/src/tb/delay.v /home/users/yuyushan/sim/rsp_s2_cp/syn/src/mult_cp.v
#/* Top-level Module                               */
set my_toplevel rsp_s1_prep 
rsp_s1_prep
#/* The name of the clock pin. If no clock-pin     */
#/* exists, pick anything                          */
set my_clock_pin clk
clk
#/* Delay of input signals (Clock-to-Q, Package etc.)  */
set my_input_delay_ns 0.0
0.0
#/* Reserved time for output signals (Holdtime etc.)   */
set my_output_delay_ns 0
0
#DC setting
set case_analysis_with_logic_constants true
true
set_host_options -max_cores 16
1
#/**************************************************/
#/* No modifications needed below                  */
#/**************************************************/
#set OSU_FREEPDK [format "%s%s"  [getenv "PDK_DIR"] "/osu_soc/lib/files"]
#set search_path [concat  $search_path "/data/pdk/"]
set TAR_PATH "/iceng/lib/stdcell/smic40/"
/iceng/lib/stdcell/smic40/
set LIN_PATH "/iceng/lib/memory/tsmc28/0.1/DB"
/iceng/lib/memory/tsmc28/0.1/DB
set search_path [concat $TAR_PATH $LIN_PATH]
/iceng/lib/stdcell/smic40/ /iceng/lib/memory/tsmc28/0.1/DB
#set alib_library_analysis_path $OSU_FREEPDK
set target_lib [list scc40nll_vhsc40_rvt_ss_v0p99_125c_basic.db ]
scc40nll_vhsc40_rvt_ss_v0p99_125c_basic.db
set link_lib [list ts6n28hpcpsvta512x128m2sw_130a_ssg0p81v125c.db]
ts6n28hpcpsvta512x128m2sw_130a_ssg0p81v125c.db
set target_library $target_lib 
scc40nll_vhsc40_rvt_ss_v0p99_125c_basic.db
#set link_library "* $target_lib" 
set link_library [list * $link_lib]
* ts6n28hpcpsvta512x128m2sw_130a_ssg0p81v125c.db
define_design_lib WORK -path ./WORK
1
set verilogout_show_unconnected_pins "true"
true
#set_ultra_optimization true
#set_ultra_optimization -force
#dont use setting
#set cell_list [get_lib_cells typical/CLK*]
#set_dont_use $cell_list
analyze -f sverilog $my_verilog_files
Running PRESTO HDLC
Compiling source file /home/users/yuyushan/sim/rsp_s2_cp/syn/src/axi4/axi_v4_rd_if.sv
Error:  Unable to open file `/home/users/yuyushan/sim/rsp_s2_cp/syn/src/axi4/axi_v4_rd_if.sv': No such file or directory. (VER-41)
*** Presto compilation terminated with 1 errors. ***
Loading db file '/iceng/lib/memory/tsmc28/0.1/DB/ts6n28hpcpsvta512x128m2sw_130a_ssg0p81v125c.db'
0
#read_sverilog $my_verilog_files
elaborate $my_toplevel
Loading db file '/home/tools/synopsys/syn/R-2020.09-SP4/libraries/syn/gtech.db'
Loading db file '/home/tools/synopsys/syn/R-2020.09-SP4/libraries/syn/standard.sldb'
  Loading link library 'ts6n28hpcpsvta512x128m2sw_ssg0p81v125c'
  Loading link library 'gtech'
Error: Cannot find the design 'rsp_s1_prep' in the library 'WORK'. (LBR-0)
0
current_design $my_toplevel
Error: Can't find design 'rsp_s1_prep'. (UID-109)
Error: Current design is not defined. (UID-4)
link
Error: Current design is not defined. (UID-4)
0
uniquify
Error: Current design is not defined. (UID-4)
0
set report_default_significant_digits 4
4
check_design
Error: Current design is not defined. (UID-4)
0
#timing constraints
#set my_period [expr "1000/$my_clk_freq_MHz"]
set my_period 1
1
set find_clock [ find port [list $my_clock_pin] ]
Error: Current design is not defined. (UID-4)
Error: Can't find port 'clk'. (UID-109)
if {  $find_clock != [list] } {
   set clk_name $my_clock_pin
   create_clock -period $my_period $clk_name
} else {
   set clk_name clk
   create_clock -period $my_period -name $clk_name
}
Error: Current design is not defined. (UID-4)
0
#set_driving_cell  -lib_cell INVX1  [all_inputs]
set_input_delay $my_input_delay_ns -clock $clk_name [remove_from_collection [all_inputs] $my_clock_pin]
Error: Current design is not defined. (UID-4)
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
set_output_delay $my_output_delay_ns -clock $clk_name [all_outputs]
Error: Current design is not defined. (UID-4)
Error: Current design is not defined. (UID-4)
Error: Can't find clock 'clk'. (UID-109)
Error: Value for list '-clock' must have 1 elements. (CMD-036)
Error: Value for list 'port_pin_list' must have 1 elements. (CMD-036)
0
set report_default_significant_digits 4
4
check_timing
Error: Current design is not defined. (UID-4)
0
#compile -map_effort high 
#compile -incremental_mapping -map_effort medium
compile_ultra -no_autoungroup
Error: Current design is not defined. (UID-4)
0
#compile_ultra
report_constraint -all_violators
Error: Current design is not defined. (UID-4)
0
change_names -rule verilog -hier
Error: Current design is not defined. (UID-4)
0
set filename [format "%s%s"  $my_toplevel ".gv"]
rsp_s1_prep.gv
write -f verilog -hier -output $filename
Error: No files or designs were specified. (UID-22)
0
set filename [format "%s%s"  $my_toplevel ".ddc"]
rsp_s1_prep.ddc
write -f ddc  -hier -output $filename
Error: No files or designs were specified. (UID-22)
0
set filename [format "%s%s"  $my_toplevel ".sdc"]
rsp_s1_prep.sdc
write_sdc $filename
Error: Current design is not defined. (UID-4)
0
#set filename [format "%s%s"  $my_toplevel ".db"]
#write -f db -hier -output $filename -xg_force_db
redirect $my_toplevel.timing { report_timing }
redirect $my_toplevel.cell { report_cell }
redirect $my_toplevel.power { report_power }
redirect $my_toplevel.area {report_area -hierarchy}
dc_shell> exit

Memory usage for this session 72 Mbytes.
Memory usage for this session including child processes 72 Mbytes.
CPU usage for this session 2 seconds ( 0.00 hours ).
Elapsed time for this session 5905 seconds ( 1.64 hours ).

Thank you...
