###################################################################

# Created by write_sdc on Fri Nov 17 14:27:41 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
create_clock [get_ports clk]  -period 1.2  -waveform {0 0.6}
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  0  [get_ports i_cmd_valid]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[28]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[27]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[26]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[25]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[24]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[23]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[22]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[21]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[20]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[19]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[18]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[17]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[16]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[15]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[14]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[13]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[12]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[11]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[10]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[9]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[8]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[7]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[6]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[5]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[4]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[3]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[2]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[1]}]
set_input_delay -clock clk  0  [get_ports {i_cmd_info[0]}]
set_input_delay -clock clk  0  [get_ports i_start]
set_input_delay -clock clk  0  [get_ports {i_start_info[7]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[6]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[5]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[4]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[3]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[2]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[1]}]
set_input_delay -clock clk  0  [get_ports {i_start_info[0]}]
set_input_delay -clock clk  0  [get_ports i_finish_ack]
set_input_delay -clock clk  0  [get_ports i_mem_req_ack]
set_input_delay -clock clk  0  [get_ports i_mem_free_ack]
set_input_delay -clock clk  0  [get_ports i_init]
set_input_delay -clock clk  0  [get_ports i_reset]
set_input_delay -clock clk  0  [get_ports i_stop]
set_input_delay -clock clk  0  [get_ports i_rerun]
set_input_delay -clock clk  0  [get_ports ahb_cfg_hsel]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_htrans[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_htrans[0]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[31]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[30]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[29]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[28]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[27]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[26]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[25]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[24]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[23]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[22]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[21]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[20]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[19]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[18]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[17]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[16]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[15]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[14]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[13]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[12]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[11]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[10]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[9]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[8]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[7]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[6]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[5]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[4]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[3]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[2]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_haddr[0]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hburst[2]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hburst[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hburst[0]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hsize[2]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hsize[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hsize[0]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[31]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[30]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[29]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[28]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[27]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[26]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[25]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[24]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[23]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[22]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[21]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[20]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[19]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[18]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[17]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[16]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[15]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[14]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[13]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[12]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[11]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[10]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[9]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[8]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[7]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[6]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[5]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[4]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[3]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[2]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[1]}]
set_input_delay -clock clk  0  [get_ports {ahb_cfg_hwdata[0]}]
set_input_delay -clock clk  0  [get_ports ahb_cfg_hwrite]
set_input_delay -clock clk  0  [get_ports ahb_cfg_hreadyin]
set_input_delay -clock clk  0  [get_ports hclk]
set_input_delay -clock clk  0  [get_ports hreset]
set_input_delay -clock clk  0  [get_ports axi_if_arready]
set_input_delay -clock clk  0  [get_ports axi_if_rvalid]
set_input_delay -clock clk  0  [get_ports {axi_if_rid[3]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rid[2]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rid[1]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rid[0]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[127]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[126]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[125]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[124]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[123]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[122]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[121]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[120]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[119]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[118]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[117]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[116]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[115]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[114]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[113]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[112]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[111]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[110]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[109]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[108]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[107]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[106]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[105]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[104]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[103]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[102]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[101]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[100]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[99]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[98]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[97]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[96]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[95]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[94]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[93]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[92]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[91]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[90]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[89]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[88]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[87]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[86]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[85]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[84]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[83]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[82]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[81]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[80]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[79]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[78]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[77]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[76]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[75]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[74]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[73]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[72]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[71]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[70]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[69]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[68]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[67]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[66]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[65]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[64]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[63]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[62]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[61]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[60]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[59]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[58]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[57]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[56]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[55]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[54]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[53]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[52]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[51]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[50]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[49]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[48]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[47]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[46]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[45]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[44]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[43]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[42]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[41]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[40]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[39]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[38]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[37]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[36]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[35]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[34]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[33]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[32]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[31]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[30]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[29]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[28]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[27]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[26]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[25]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[24]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[23]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[22]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[21]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[20]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[19]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[18]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[17]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[16]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[15]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[14]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[13]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[12]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[11]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[10]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[9]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[8]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[7]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[6]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[5]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[4]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[3]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[2]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[1]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rdata[0]}]
set_input_delay -clock clk  0  [get_ports axi_if_rlast]
set_input_delay -clock clk  0  [get_ports {axi_if_rresp[1]}]
set_input_delay -clock clk  0  [get_ports {axi_if_rresp[0]}]
set_input_delay -clock clk  0  [get_ports axi_if_awready]
set_input_delay -clock clk  0  [get_ports axi_if_wready]
set_input_delay -clock clk  0  [get_ports axi_if_bvalid]
set_input_delay -clock clk  0  [get_ports {axi_if_bid[3]}]
set_input_delay -clock clk  0  [get_ports {axi_if_bid[2]}]
set_input_delay -clock clk  0  [get_ports {axi_if_bid[1]}]
set_input_delay -clock clk  0  [get_ports {axi_if_bid[0]}]
set_input_delay -clock clk  0  [get_ports {axi_if_bresp[1]}]
set_input_delay -clock clk  0  [get_ports {axi_if_bresp[0]}]
set_output_delay -clock clk  0  [get_ports o_cmd_ack]
set_output_delay -clock clk  0  [get_ports o_start_ack]
set_output_delay -clock clk  0  [get_ports o_finish]
set_output_delay -clock clk  0  [get_ports {o_finish_info[7]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[6]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[5]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[4]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[3]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[2]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[1]}]
set_output_delay -clock clk  0  [get_ports {o_finish_info[0]}]
set_output_delay -clock clk  0  [get_ports o_mem_req]
set_output_delay -clock clk  0  [get_ports {o_mem_req_bm[7]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_bm[6]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_bm[5]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_bm[4]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_bm[3]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_bm[2]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_bm[1]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_bm[0]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_rd[7]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_rd[6]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_rd[5]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_rd[4]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_rd[3]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_rd[2]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_rd[1]}]
set_output_delay -clock clk  0  [get_ports {o_mem_req_rd[0]}]
set_output_delay -clock clk  0  [get_ports o_mem_free]
set_output_delay -clock clk  0  [get_ports {o_mem_free_bm[7]}]
set_output_delay -clock clk  0  [get_ports {o_mem_free_bm[6]}]
set_output_delay -clock clk  0  [get_ports {o_mem_free_bm[5]}]
set_output_delay -clock clk  0  [get_ports {o_mem_free_bm[4]}]
set_output_delay -clock clk  0  [get_ports {o_mem_free_bm[3]}]
set_output_delay -clock clk  0  [get_ports {o_mem_free_bm[2]}]
set_output_delay -clock clk  0  [get_ports {o_mem_free_bm[1]}]
set_output_delay -clock clk  0  [get_ports {o_mem_free_bm[0]}]
set_output_delay -clock clk  0  [get_ports o_mem_claim]
set_output_delay -clock clk  0  [get_ports {o_mem_claim_bm[7]}]
set_output_delay -clock clk  0  [get_ports {o_mem_claim_bm[6]}]
set_output_delay -clock clk  0  [get_ports {o_mem_claim_bm[5]}]
set_output_delay -clock clk  0  [get_ports {o_mem_claim_bm[4]}]
set_output_delay -clock clk  0  [get_ports {o_mem_claim_bm[3]}]
set_output_delay -clock clk  0  [get_ports {o_mem_claim_bm[2]}]
set_output_delay -clock clk  0  [get_ports {o_mem_claim_bm[1]}]
set_output_delay -clock clk  0  [get_ports {o_mem_claim_bm[0]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[31]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[30]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[29]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[28]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[27]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[26]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[25]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[24]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[23]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[22]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[21]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[20]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[19]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[18]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[17]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[16]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[15]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[14]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[13]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[12]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[11]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[10]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[9]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[8]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[7]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[6]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[5]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[4]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[3]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[2]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[1]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hrdata[0]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hresp[1]}]
set_output_delay -clock clk  0  [get_ports {ahb_cfg_hresp[0]}]
set_output_delay -clock clk  0  [get_ports ahb_cfg_hready]
set_output_delay -clock clk  0  [get_ports axi_if_arvalid]
set_output_delay -clock clk  0  [get_ports {axi_if_arid[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arid[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arid[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arid[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[31]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[30]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[29]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[28]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[27]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[26]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[25]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[24]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[23]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[22]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[21]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[20]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[19]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[18]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[17]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[16]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[15]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[14]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[13]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[12]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[11]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[10]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[9]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[8]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[7]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[6]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[5]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[4]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_araddr[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arlen[7]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arlen[6]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arlen[5]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arlen[4]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arlen[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arlen[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arlen[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arlen[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arburst[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arburst[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arsize[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arsize[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arsize[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arcache[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arcache[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arcache[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arcache[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arprot[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arprot[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_arprot[0]}]
set_output_delay -clock clk  0  [get_ports axi_if_arlock]
set_output_delay -clock clk  0  [get_ports axi_if_rready]
set_output_delay -clock clk  0  [get_ports axi_if_awvalid]
set_output_delay -clock clk  0  [get_ports {axi_if_awid[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awid[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awid[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awid[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[31]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[30]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[29]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[28]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[27]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[26]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[25]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[24]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[23]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[22]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[21]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[20]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[19]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[18]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[17]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[16]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[15]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[14]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[13]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[12]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[11]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[10]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[9]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[8]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[7]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[6]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[5]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[4]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awaddr[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awlen[7]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awlen[6]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awlen[5]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awlen[4]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awlen[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awlen[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awlen[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awlen[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awburst[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awburst[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awsize[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awsize[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awsize[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awcache[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awcache[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awcache[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awcache[0]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awprot[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awprot[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_awprot[0]}]
set_output_delay -clock clk  0  [get_ports axi_if_awlock]
set_output_delay -clock clk  0  [get_ports axi_if_wvalid]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[127]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[126]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[125]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[124]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[123]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[122]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[121]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[120]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[119]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[118]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[117]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[116]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[115]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[114]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[113]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[112]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[111]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[110]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[109]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[108]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[107]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[106]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[105]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[104]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[103]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[102]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[101]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[100]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[99]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[98]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[97]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[96]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[95]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[94]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[93]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[92]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[91]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[90]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[89]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[88]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[87]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[86]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[85]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[84]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[83]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[82]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[81]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[80]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[79]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[78]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[77]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[76]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[75]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[74]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[73]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[72]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[71]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[70]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[69]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[68]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[67]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[66]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[65]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[64]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[63]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[62]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[61]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[60]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[59]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[58]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[57]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[56]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[55]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[54]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[53]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[52]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[51]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[50]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[49]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[48]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[47]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[46]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[45]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[44]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[43]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[42]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[41]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[40]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[39]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[38]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[37]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[36]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[35]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[34]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[33]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[32]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[31]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[30]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[29]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[28]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[27]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[26]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[25]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[24]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[23]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[22]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[21]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[20]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[19]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[18]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[17]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[16]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[15]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[14]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[13]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[12]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[11]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[10]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[9]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[8]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[7]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[6]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[5]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[4]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wdata[0]}]
set_output_delay -clock clk  0  [get_ports axi_if_wlast]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[15]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[14]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[13]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[12]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[11]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[10]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[9]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[8]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[7]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[6]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[5]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[4]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[3]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[2]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[1]}]
set_output_delay -clock clk  0  [get_ports {axi_if_wstrb[0]}]
set_output_delay -clock clk  0  [get_ports axi_if_bready]
set_output_delay -clock clk  0  [get_ports {o_event[15]}]
set_output_delay -clock clk  0  [get_ports {o_event[14]}]
set_output_delay -clock clk  0  [get_ports {o_event[13]}]
set_output_delay -clock clk  0  [get_ports {o_event[12]}]
set_output_delay -clock clk  0  [get_ports {o_event[11]}]
set_output_delay -clock clk  0  [get_ports {o_event[10]}]
set_output_delay -clock clk  0  [get_ports {o_event[9]}]
set_output_delay -clock clk  0  [get_ports {o_event[8]}]
set_output_delay -clock clk  0  [get_ports {o_event[7]}]
set_output_delay -clock clk  0  [get_ports {o_event[6]}]
set_output_delay -clock clk  0  [get_ports {o_event[5]}]
set_output_delay -clock clk  0  [get_ports {o_event[4]}]
set_output_delay -clock clk  0  [get_ports {o_event[3]}]
set_output_delay -clock clk  0  [get_ports {o_event[2]}]
set_output_delay -clock clk  0  [get_ports {o_event[1]}]
set_output_delay -clock clk  0  [get_ports {o_event[0]}]
set_output_delay -clock clk  0  [get_ports {o_irq[3]}]
set_output_delay -clock clk  0  [get_ports {o_irq[2]}]
set_output_delay -clock clk  0  [get_ports {o_irq[1]}]
set_output_delay -clock clk  0  [get_ports {o_irq[0]}]
